poc/results/x-cross/smoke/early-runs/20260813T213018+0800/galera-vm-6node-rc-20260813T213018+0800-scenarioG5-diskslow/fio-summary.txt
chaos-c7-contention: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.19
Starting 4 processes
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
[...]

chaos-c7-contention: (groupid=0, jobs=4): err= 0: pid=12395: Thu Aug 13 23:13:29 2026
  write: IOPS=41.0k, BW=160MiB/s (168MB/s)(4811MiB/30034msec); 0 zone resets
    slat (nsec): min=1549, max=103157k, avg=73575.44, stdev=1657436.63
    clat (usec): min=239, max=106536, avg=6168.55, stdev=14479.93
     lat (usec): min=243, max=106539, avg=6242.23, stdev=14559.26
    clat percentiles (usec):
     |  1.00th=[   529],  5.00th=[   734], 10.00th=[   922], 20.00th=[  1172],
     | 30.00th=[  1434], 40.00th=[  1778], 50.00th=[  2180], 60.00th=[  2835],
     | 70.00th=[  3458], 80.00th=[  4113], 90.00th=[  6128], 95.00th=[ 44303],
     | 99.00th=[ 70779], 99.50th=[ 76022], 99.90th=[ 83362], 99.95th=[100140],
     | 99.99th=[105382]
   bw (  KiB/s): min=110760, max=347195, per=99.58%, avg=163329.34, stdev=10526.89, samples=236
   iops        : min=27690, max=86798, avg=40832.31, stdev=2631.71, samples=236
  lat (usec)   : 250=0.01%, 500=0.69%, 750=4.74%, 1000=7.40%
  lat (msec)   : 2=32.94%, 4=32.77%, 10=13.86%, 20=1.56%, 50=1.43%
  lat (msec)   : 100=4.56%, 250=0.05%
  cpu          : usr=1.07%, sys=6.13%, ctx=126361, majf=0, minf=46
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,1231529,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=160MiB/s (168MB/s), 160MiB/s-160MiB/s (168MB/s-168MB/s), io=4811MiB (5044MB), run=30034-30034msec

Disk stats (read/write):
  sda: ios=1/1570179, merge=0/80489, ticks=1/1487478, in_queue=1487479, util=32.41%